alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
	/* THE v0.2.3 got==0 root cause: CTL1.DMA alone stops issuing
     * requests after one DMA run.  CTL1.DDM (request-after-last) keeps
     * the request line live so the circular channel refills forever --
     * the vendor reference enables BOTH, in this order. */
	adc_dma_request_after_last_enable(ch->periph);
	adc_dma_mode_enable(ch->periph);

	/* Clear any End-Of-Conversion left by a prior single-shot
     * bridge_hw_adc_read on this peripheral BEFORE the converter
     * re-enables -- a stale EOC otherwise fires one spurious DMA
     * beat the moment the request unmasks, depositing a phantom
     * zeroth sample and desynchronising the ring cursor.  ROVF gets
     * the same treatment: overflow detection is live the instant
     * ADCON sets (DMA is already enabled above), and a session-stale
     * ROVF left set would stall conversion before the first sample
     * (UM Rev1.2 17.4.12, p.431-432; #44). */
	adc_flag_clear(ch->periph, ADC_FLAG_EOC);
	adc_flag_clear(ch->periph, ADC_FLAG_ROVF);
	adc_enable(ch->periph);
	for (volatile uint32_t stab = 0u; stab < 4096u; ++stab) {
		/* tSTAB dwell after ADCON, same bound adc_periph_init uses */
	}
	/* Recalibrate after the ADCON toggle above -- see the disable/
     * enable comment at the top of this bracket (#34).  Bounded, cost
     * ~25 us (adc.c's bridge_hw_adc_read carries the full derivation);
     * a false return means the calibration FSM never finished, so
     * fail the begin rather than arm a stream on an unproven
     * converter -- the DMA channel + lap ISR are not armed yet at
     * this point, so there is no live stream state to unwind. */
	if (!adc_calibrate_bounded(ch->periph)) return BRIDGE_HW_ERR_IO;

	/* Arm the lap counter BEFORE the channel starts: clear any stale
	 * full-transfer flag from a prior session on this controller, then
	 * enable the FTF interrupt + its NVIC line so EVERY ring reload is
	 * counted -- the overrun detection in stream_read is exact
	 * total-written-vs-read accounting, not a heuristic. */
	s->lap_count = 0u;
	dma_flag_clear(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_FLAG_FTF);
	dma_interrupt_enable(s->dma_periph, (dma_channel_enum)s->dma_channel, DMA_INT_FTF);
	nvic_irq_enable((s->dma_periph == DMA0) ? DMA0_Channel0_IRQn : DMA1_Channel0_IRQn,
	                ADC_STREAM_LAP_IRQ_PRIO,
	                ADC_STREAM_LAP_IRQ_SUBPRIO);

	dma_channel_enable(s->dma_periph, (dma_channel_enum)s->dma_channel);

	/* Route the pacing timer's update-event TRGO0 to this converter's
     * routine trigger, then run the timer at the requested rate.  Two
     * prescaler regimes keep the 16-bit period in range: a 1 MHz tick
     * covers 16 Hz..100 kHz exactly where it matters; below 16 Hz a
     * 10 kHz tick stretches to 1 Hz.  Division truncates -- worst-case
     * quantisation is one tick (documented in the protocol spec). */
	rcu_periph_clock_enable(RCU_TRIGSEL);
	trigsel_init(adc_stream_routrg(ch->periph),
	             (stream_id == 0u) ? TRIGSEL_INPUT_TIMER5_TRGO0 : TRIGSEL_INPUT_TIMER6_TRGO0);

	rcu_periph_clock_enable((stream_id == 0u) ? RCU_TIMER5 : RCU_TIMER6);
	timer_deinit(s->pace_timer);
	uint32_t psc, period_ticks;
	if (sample_rate_hz >= 16u) {
		psc          = (BRIDGE_ADC_PACE_CLK_HZ / 1000000u) - 1u; /* 1 MHz tick  */
		period_ticks = 1000000u / sample_rate_hz;                /* 10..62500   */
	} else {
		psc          = (BRIDGE_ADC_PACE_CLK_HZ / 10000u) - 1u; /* 10 kHz tick */
		period_ticks = 10000u / sample_rate_hz;                /* 667..10000  */
	}
	timer_parameter_struct tp;
	timer_struct_para_init(&tp);
	tp.prescaler = (uint16_t)psc;
	tp.period    = period_ticks - 1u;
	timer_init(s->pace_timer, &tp);
	timer_master_output0_trigger_source_select(s->pace_timer, TIMER_TRI_OUT0_SRC_UPDATE);
	timer_enable(s->pace_timer);

	s->in_use  = true;
	s->channel = channel;
	/* Snapshot the full-scale for the mv math so a mid-stream
	 * bridge_hw_adc_configure (which only rewrites the cache) can't
	 * change the divisor under a running stream -- the converter keeps
	 * the format this begin applied until stream_end. */
	s->full_scale   = adc_full_scale_for_bits(adc_resolution_bits_cache[channel]);
	s->read_idx     = 0u;
	s->total_read   = 0u; /* lap_count zeroed above, pre-arm */
	s->dsp_chain_id = 0u;
	s->dsp_bound    = false;
	return BRIDGE_HW_OK;
}

/* Recover the ADC from a routine-data overflow (#44) -- the 9-step
 * sequence UM Rev1.2 17.4.12 (p.431-432) documents.  Steps 2 and 7
 * toggle ADCON, which invalidates the calibration factor the same way
 * stream_begin's disable/enable does (#34): recalibrate before
 * returning so the stream resumes on a proven converter, not merely
 * an unstalled one.  DDM (request-after-last) and the external-
 * trigger routine config are untouched by this sequence and the
 * pacing timer never stopped, so step 9 ("start conversion") needs no
 * explicit call here -- the next TRGO edge resumes conversion once
 * ADCON is back.  Returns false only if the recalibration's bounded
 * spin never completes (the converter itself stayed wedged). */
static bool adc_stream_recover_rovf(adc_stream_state_t *s, const gd32_adc_ch_t *ch)
{
	adc_dma_mode_disable(ch->periph); /* 1. Clear DMA bit of ADC_CTL1. */
	adc_disable(ch->periph);          /* 2. Clear ADCON bit of ADC_CTL1. */

	/* 3. Clear CHEN bit of DMA_CHxCTL, reinit the DMA module.  The
	 * count register is reloaded to the full ring length explicitly:
	 * an overflow almost certainly caught the channel mid-ring rather
	 * than exactly at a circular-reload boundary. */
	dma_channel_disable(s->dma_periph, (dma_channel_enum)s->dma_channel);
	dma_transfer_number_config(
	    s->dma_periph, (dma_channel_enum)s->dma_channel, BRIDGE_ADC_STREAM_RING_SAMPLES);

	adc_flag_clear(ch->periph, ADC_FLAG_ROVF); /* 4. Clear ROVF bit of ADC_STAT. */
	dma_channel_enable(s->dma_periph, (dma_channel_enum)s->dma_channel); /* 5. Set CHEN. */
	adc_dma_mode_enable(ch->periph); /* 6. Set DMA bit of ADC_CTL1. */
	adc_enable(ch->periph);          /* 7. Set ADCON bit of ADC_CTL1. */
	for (volatile uint32_t stab = 0u; stab < 4096u; ++stab) {
		/* 8. Wait T(setup) -- same bound stream_begin/adc_periph_init use. */
	}
	return adc_calibrate_bounded(ch->periph); /* ADCON edge above invalidated calibration. */
}

int bridge_hw_adc_stream_read(uint8_t   stream_id,
                              uint8_t   max_samples,
                              uint8_t  *got_samples,
                              uint16_t *mv)
{
	if (got_samples == 0) return BRIDGE_HW_ERR_INVAL;
	*got_samples = 0u;
	if (mv == 0) return BRIDGE_HW_ERR_INVAL;
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;

	adc_stream_state_t *s = &adc_streams[stream_id];
	if (!s->in_use) return BRIDGE_HW_ERR_INVAL;

	/* ROVF (routine-data overflow) recovery (#44) -- checked before
	 * EITHER data plane below, raw or DSP-filtered: both draw from
	 * this stream's DMA ring, and UM Rev1.2 17.4.12 (p.431-432) is
	 * explicit that "[t]he ADC conversion will be stalled until the
	 * ROVF bit is cleared" -- unrecovered, the write index freezes and
	 * every subsequent poll answers STATUS_OK with zero samples,
	 * forever, on both planes. */
	const gd32_adc_ch_t *ch = &adc_channels_map[s->channel];
	if (SET == adc_flag_get(ch->periph, ADC_FLAG_ROVF)) {
		const bool     recal_ok = adc_stream_recover_rovf(s, ch);
		const uint16_t w        = adc_stream_write_index(s);
		s->read_idx             = w;
		s->total_read           = s->lap_count * BRIDGE_ADC_STREAM_RING_SAMPLES + (uint32_t)w;
		s->pump_raw_read        = s->total_read;
		/* Same wire contract as the ring-overrun branch below
		 * (docs/gd32-bridge-protocol.md §3.10): STATUS_BUSY, "poll
		 * faster".  A failed recalibration is the harder failure --
		 * report IO so the host doesn't keep polling a converter left
		 * in an unproven state. */
		return recal_ok ? BRIDGE_HW_ERR_BUSY : BRIDGE_HW_ERR_IO;
	}

