alplabai/gd32-bridge-firmware/hal/gd32/adc_stream.c
int bridge_hw_adc_dsp_chain_open(uint8_t *chain_id)
{
	if (chain_id == 0) return BRIDGE_HW_ERR_INVAL;
	*chain_id = 0u;

	/* First-fit search over the chain pool.  The pool is small (4
     * entries today) so the linear scan is comfortably faster than
     * any free-list bookkeeping would be; if the pool grows, this
     * function is the natural place to add a free-list head. */
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_CHAINS; ++i) {
		if (!adc_dsp_chains[i].in_use) {
			/* Zero the chain state so a previously-released chain
             * doesn't leak stale stage data into the new allocation. */
			for (uint8_t s = 0u; s < BRIDGE_DSP_MAX_STAGES; ++s) {
				adc_dsp_chains[i].stages[s].kind           = 0u;
				adc_dsp_chains[i].stages[s].total_size     = 0u;
				adc_dsp_chains[i].stages[s].bytes_received = 0u;
				adc_dsp_chains[i].stages[s].complete       = false;
			}
			adc_dsp_chains[i].in_use = true;
			adc_dsp_chains[i].bound  = false;
			*chain_id                = i;
			return BRIDGE_HW_OK;
		}
	}
	/* Pool exhaustion.  Protocol layer maps BRIDGE_HW_ERR_NOTIMPL to
     * STATUS_NOSUPPORT (0x06) today.  STATUS_NOMEM (0x07) has 17
     * defensive reply_cap guards in protocol.c, but both transports
     * pass a 65-byte reply buffer so none of them can fire on the
     * wire -- what's missing is a NOMEM-equivalent BRIDGE_HW_ERR_*
     * here in hal/bridge_hw.h for this path. */
	return BRIDGE_HW_ERR_NOTIMPL;
}

int bridge_hw_adc_dsp_stage_push(uint8_t        chain_id,
                                 uint8_t        stage_index,
                                 uint8_t        kind,
                                 uint16_t       chunk_offset,
                                 uint16_t       chunk_total_size,
                                 const uint8_t *chunk_data,
                                 size_t         chunk_data_len)
{
	if (chain_id >= BRIDGE_DSP_MAX_CHAINS) return BRIDGE_HW_ERR_RANGE;
	if (stage_index >= BRIDGE_DSP_MAX_STAGES) return BRIDGE_HW_ERR_RANGE;
	if (kind > BRIDGE_DSP_KIND_MAX) return BRIDGE_HW_ERR_INVAL;
	if (chunk_total_size == 0u) return BRIDGE_HW_ERR_INVAL;
	if (chunk_total_size > BRIDGE_DSP_MAX_STAGE_BYTES) return BRIDGE_HW_ERR_RANGE;
	if (chunk_data_len == 0u || chunk_data == 0) return BRIDGE_HW_ERR_INVAL;
	/* `chunk_offset + chunk_data_len <= chunk_total_size` -- guard
     * against integer overflow on the addition (both inputs are
     * 16-bit-bounded above) by doing the subtraction. */
	if (chunk_data_len > (size_t)(chunk_total_size - chunk_offset)) return BRIDGE_HW_ERR_RANGE;

	adc_dsp_chain_t *chain = &adc_dsp_chains[chain_id];
	if (!chain->in_use) return BRIDGE_HW_ERR_INVAL;
	if (chain->bound) return BRIDGE_HW_ERR_INVAL; /* mutation after bind */

	adc_dsp_stage_t *st = &chain->stages[stage_index];

	if (chunk_offset == 0u) {
		/* First chunk of this stage.  Seed `kind` + `total_size`;
         * any subsequent chunks must agree with these values so a
         * mid-upload re-target of the stage is caught as INVAL. */
		st->kind           = kind;
		st->total_size     = chunk_total_size;
		st->bytes_received = 0u;
		st->complete       = false;
	} else {
		/* Continuation chunk.  The host must keep the same kind +
         * total_size as the first chunk of this (chain, stage)
         * pair -- otherwise the buffer would be a mix of two
         * different stage payloads. */
		if (st->total_size == 0u) return BRIDGE_HW_ERR_INVAL; /* stage not yet opened */
		if (st->kind != kind) return BRIDGE_HW_ERR_INVAL;
		if (st->total_size != chunk_total_size) return BRIDGE_HW_ERR_INVAL;
		if (st->complete) return BRIDGE_HW_ERR_INVAL; /* already done */
	}

	for (size_t i = 0u; i < chunk_data_len; ++i) {
		st->data[chunk_offset + i] = chunk_data[i];
	}
	st->bytes_received += (uint16_t)chunk_data_len;
	if (st->bytes_received == st->total_size) {
		st->complete = true;
	}
	return BRIDGE_HW_OK;
}

int bridge_hw_adc_dsp_chain_bind(uint8_t chain_id, uint8_t stream_id)
{
	if (chain_id >= BRIDGE_DSP_MAX_CHAINS) return BRIDGE_HW_ERR_RANGE;
	if (stream_id >= BRIDGE_ADC_STREAM_COUNT) return BRIDGE_HW_ERR_RANGE;

	adc_dsp_chain_t *chain = &adc_dsp_chains[chain_id];
	if (!chain->in_use) return BRIDGE_HW_ERR_INVAL;
	if (chain->bound) return BRIDGE_HW_ERR_INVAL; /* already attached */

	/* Validate every populated stage is complete + the chain
     * follows the ordering rules documented in
     * `bridge_hw_adc_dsp_chain_bind`'s contract:
     *   - FFT must be the terminal stage (no stage after it),
     *   - WINDOW must immediately precede FFT,
     *   - empty stages (total_size == 0) are allowed only at
     *     contiguous tail positions -- not interleaved with
     *     populated stages. */
	uint8_t fft_index            = BRIDGE_DSP_MAX_STAGES;
	uint8_t window_index         = BRIDGE_DSP_MAX_STAGES;
	uint8_t last_populated_index = BRIDGE_DSP_MAX_STAGES;
	for (uint8_t i = 0u; i < BRIDGE_DSP_MAX_STAGES; ++i) {
		adc_dsp_stage_t *st = &chain->stages[i];
		if (st->total_size == 0u) continue;
		if (!st->complete) return BRIDGE_HW_ERR_INVAL; /* mid-upload */
		/* Payload well-formed for its kind?  stage_push checked only the
         * byte count + kind range; this is where a malformed FIR/IIR/
         * WINDOW/FFT blob is caught, before it can mis-program the HW. */
		if (!adc_dsp_stage_blob_valid(st)) return BRIDGE_HW_ERR_INVAL;
		if (last_populated_index != BRIDGE_DSP_MAX_STAGES &&
		    (uint8_t)(i - last_populated_index) != 1u) {
			return BRIDGE_HW_ERR_INVAL; /* gap in stage list */
		}
		last_populated_index = i;
		if (st->kind == 3u /* FFT */) {
			if (fft_index != BRIDGE_DSP_MAX_STAGES) return BRIDGE_HW_ERR_INVAL;
			fft_index = i;
		} else if (st->kind == 2u /* WINDOW */) {
			if (window_index != BRIDGE_DSP_MAX_STAGES) return BRIDGE_HW_ERR_INVAL;
			window_index = i;
		}
	}
	if (last_populated_index == BRIDGE_DSP_MAX_STAGES) {
		return BRIDGE_HW_ERR_INVAL; /* empty chain */
	}
	if (fft_index != BRIDGE_DSP_MAX_STAGES) {
		/* FFT must be terminal -- no populated stage after it. */
		if (fft_index != last_populated_index) return BRIDGE_HW_ERR_INVAL;
		/* WINDOW (if present) must directly precede the FFT. */
		if (window_index != BRIDGE_DSP_MAX_STAGES &&
		    (fft_index == 0u || window_index != fft_index - 1u)) {
			return BRIDGE_HW_ERR_INVAL;
		}
	} else if (window_index != BRIDGE_DSP_MAX_STAGES) {
		/* WINDOW without a terminating FFT has no defined meaning in
         * the filtered-samples path -- reject per docs/gd32-bridge-
         * protocol.md §3.x. */
		return BRIDGE_HW_ERR_INVAL;
	}

	adc_stream_state_t *s = &adc_streams[stream_id];
	if (!s->in_use) return BRIDGE_HW_ERR_INVAL;   /* stream not running */
	if (s->dsp_bound) return BRIDGE_HW_ERR_INVAL; /* stream already has a chain */

	/* One FAC block -> one filter (FIR/IIR) stream at a time.  A FFT
	 * terminal uses the separate FFT block, so it's exempt. */
	const uint8_t terminal_kind = chain->stages[last_populated_index].kind;
	if (terminal_kind != 3u /* not FFT */ && adc_dsp_filter_stream_busy(stream_id)) {
		return BRIDGE_HW_ERR_NOTIMPL; /* FAC already serving another stream */
	}

	/* Attachment is a state flip on both halves.  The terminal stage
     * kind decides the data plane: FIR/IIR -> the base-level pump
     * filters raw samples through the FAC into this stream's processed
     * ring and stream_read serves filtered mV; FFT -> stream_read
     * answers NOSUPPORT (spectrum is read via CMD_ADC_SPECTRUM_READ).
     * Reset the processed-ring cursors so the pump starts clean. */
	s->dsp_terminal  = chain->stages[last_populated_index].kind;
	s->proc_write    = 0u;
	s->proc_read     = 0u;
	s->pump_raw_read = s->total_read; /* pump picks up where the raw reader is */
	s->dsp_chain_id  = chain_id;
	s->dsp_bound     = true;
	chain->bound     = true;
	return BRIDGE_HW_OK;
}

/* =====================================================================
 * #496 FAC FIR/IIR runtime dispatch -- the filtered data plane.
 *
 * A bound FIR/IIR chain routes the raw ADC stream through the GD32 FAC
 * hardware filter (first-lit 2026-07-13: coeffs in X1, DEEP X0 input
 * buffer, clip-enabled, batch or streaming).  The FILTER runs in the
 * base-level pump (bridge_hw_dsp_pump, from the main WFI loop) -- NEVER
 * in stream_read (the CS-EXTI transport handler, prio 1) where even a
 * modest FIR would add link latency (the 2026-06-04 link-rot mode).
 *
 * There is ONE FAC block, so ONE filter stream may be bound at a time;
 * chain_bind rejects a second filter chain with NOSUPPORT (below).
 * ===================================================================== */

/* stream_id currently loaded into the FAC, or -1 when the FAC is idle. */
static int8_t adc_dsp_fac_owner = -1;

/* Is a FIR/IIR (filter, not FFT) chain already bound to some OTHER
 * stream?  The single FAC can serve only one at a time. */
bool adc_dsp_filter_stream_busy(uint8_t except_stream)
{
	for (uint8_t i = 0u; i < BRIDGE_ADC_STREAM_COUNT; ++i) {
		if (i == except_stream) continue;
		if (adc_streams[i].in_use && adc_streams[i].dsp_bound &&
		    adc_streams[i].dsp_terminal != 3u /* not FFT */) {
			return true;
		}
	}
	return false;
}

/* Release the FAC if this stream owned it (called from stream_end). */
void adc_dsp_fac_release(uint8_t stream_id)
{
	if (adc_dsp_fac_owner == (int8_t)stream_id) {
		fac_stop();
		adc_dsp_fac_owner = -1;
	}
}

